""" Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) | """

print('Введите трехзначное число')
n= int(input())
n1 = int(n/100)
n2 = int(n%10)
n3 = int(n%100/10)

sum = (n1 + n2 + n3) 

print(f"Сумма числа {n} равна {sum}")